## Lab 3.2 - Pivot Tables

In [3]:
import pandas as pd
import numpy as np

# Read in rock.csv as a data frame

rock = pd.read_csv('https://raw.githubusercontent.com/ga-students/DSI-DC-1/master/week-02/3.2-lab/assets/datasets/rock.csv?token=ARcgBy6NeYvj39jTn0WXgZ6Nrnkxg_W0ks5XIN7NwA%3D%3D')

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0

In [4]:
# The simplest pivot table must have a dataframe and an index . Let’s use the ARTIST CLEAN as our index.
rock_pivot = pd.pivot_table(rock, index=['ARTIST CLEAN'])
rock_pivot.head(3)

                    F*G  First?  PlayCount  Year?
ARTIST CLEAN
.38 Special   46.250000     1.0  47.000000   0.75
10cc           1.000000     1.0   1.000000   1.00
3 Doors Down   6.666667     1.0   6.666667   1.00

In [5]:
# How about indexing on multiple values. Let's look at the 
# data by ARTIST CLEAN and Release Year next. 
rock_pivot = pd.pivot_table(rock, index=['ARTIST CLEAN', 'Release Year'])

                            F*G  First?  PlayCount  Year?
ARTIST CLEAN Release Year
.38 Special  1980          18.0     1.0       18.0    1.0
             1981          85.0     1.0       85.0    1.0
             1982          82.0     1.0       82.0    1.0
10cc         1975           1.0     1.0        1.0    1.0

In [6]:
# What we really want to take a look at next is PlayCount. So, 
# the F*G, First?, and Year? columns aren’t useful. Let’s 
# remove them and explicitly define the 'PlayCount' column by 
# using the values field.
rock_pivot = pd.pivot_table(rock, index=['ARTIST CLEAN', 'Release Year'], values=['PlayCount'])

                           PlayCount
ARTIST CLEAN Release Year
.38 Special  1980               18.0
             1981               85.0
             1982               82.0
10cc         1975                1.0

In [8]:
# The 'PlayCount' column automatically averages the data.  
# We can do a count or a sum by using aggfunc and np.sum.
rock_pivot = pd.pivot_table(rock, index=['ARTIST CLEAN', 'Release Year'], values=['PlayCount'], aggfunc=np.sum)
rock_pivot.head()

                           PlayCount
ARTIST CLEAN Release Year
.38 Special  1980                 18
             1981                 85
             1982                 82
10cc         1975                  1
3 Doors Down 2000                 14

## Bonus

In [9]:
# Read in realEstate.csv as a data frame

real_estate = pd.read_csv('https://raw.githubusercontent.com/ga-students/DSI-DC-1/master/week-02/3.2-lab/assets/datasets/Sacramentorealestatetransactions.csv?token=ARcgBzwvce95iQ2mHBcJIno02mTmU_6rks5XIOI9wA%3D%3D')

In [10]:
# The simplest pivot table must have a dataframe and an 
# index . Let’s use the city as our index.
real_pivot = pd.pivot_table(real_estate, index=['city'])

,baths,beds,latitude,longitude,price,sq__ft,zip
city,,,,,,,
ANTELOPE,2.212121,3.363636,38.714018,-121.362247,232496.393939,1716.636364,95843.0
AUBURN,2.600000,3.000000,38.912847,-121.082133,405890.800000,898.600000,95603.0
CAMERON PARK,1.666667,2.444444,38.685578,-120.998527,267944.444444,224.000000,95682.0
CARMICHAEL,1.850000,3.050000,38.640161,-121.325816,295684.750000,1553.100000,95608.0
CITRUS HEIGHTS,1.914286,3.228571,38.701383,-121.300204,187114.914286,1308.685714,95618.8

In [11]:
# How about indexing on multiple values. Let's look at the 
# data by city and zip next. 
real_pivot = pd.pivot_table(real_estate, index=['city', 'zip'])

,,baths,beds,latitude,longitude,price,sq__ft
city,zip,,,,,,
ANTELOPE,95843,2.212121,3.363636,38.714018,-121.362247,232496.393939,1716.636364
AUBURN,95603,2.600000,3.000000,38.912847,-121.082133,405890.800000,898.600000
CAMERON PARK,95682,1.666667,2.444444,38.685578,-120.998527,267944.444444,224.000000
CARMICHAEL,95608,1.850000,3.050000,38.640161,-121.325816,295684.750000,1553.100000
CITRUS HEIGHTS,95610,2.428571,3.428571,38.699737,-121.263907,226436.285714,1578.142857

In [13]:
# What we really want to take a look at next is price. So, 
# let's explicitly define the 'price' column by 
# using the values field.

# The 'price' column automatically averages the data.  
# We can do a count or a sum by using aggfunc and np.sum.
real_pivot = pd.pivot_table(real_estate, index=['city', 'zip'], values=['price'], aggfunc=np.sum)
real_pivot.head()

                        price
city           zip
ANTELOPE       95843  7672381
AUBURN         95603  2029454
CAMERON PARK   95682  2411500
CARMICHAEL     95608  5913695
CITRUS HEIGHTS 95610  1585054